---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepProfileParam
source: html/b2b4323d-3b34-2770-e2a2-593183007985.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepProfileParam Property

"Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepProfileParam { get; }
```